We want to delete trailing whitespace after every save.
#+BEGIN_SRC emacs-lisp
(add-hook 'before-save-hook 'delete-trailing-whitespace)
#+END_SRC

#+RESULTS:
| delete-trailing-whitespace |
